title: Remote System Discovery via Net View
status: experimental
description: Detects net.exe view command
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\net.exe'
        CommandLine|contains: 'view'
    condition: selection
level: medium
tags:
    - attack.discovery
    - attack.t1018